# ---
# jupyter:
#   jupytext:
#     text_representation:
#       extension: .py
#       format_name: light
#       format_version: '1.5'
#       jupytext_version: 1.16.4
# ---

"""Chapter."""

# Introduction to Python

# Python - это бесплатный интерпретируемый высокоуровневый язык программи­
# рования общего назначения с открытым исходным кодом

# 2.2.7. Python Interpreters 1

# По определению интерпретатор - это разновидность компьютерной программы, 
# которая непосредственно выполняет инструкции, написанные на каком-либо языке 

# 2.2.8. Object orientation 1

# Python поддерживает процедурно-ориентированное программирование, а также 
# объектно-ориентированное программирование. В процедурно-ориентированных: 
# языках программа состоит из процедур или функций, в которых заключены много-
