"""Модуль содержит объяснения понятий рефакторинга и code review."""

#
# 1. рефакторинг — это анализ и улучшение, оптимизация кода и  подготовка к code review
# 2. Code Review - это процесс проверки и анализа кода задачи разработчиком перед ее релизом. CR (Code Review) выполняется не тем человеком, который делал задачу, а другими членами команды. Результатом CR является обратная связь по выполненной задаче: необходимость внести правки, либо готовность задачи к последующему тестированию и релизу.
#
