"""Введение в парсинг.

Этот модуль демонстрирует, как обойти защиту сервера. замаскировавшись под
браузер. Для этого мы отправляем заголовки, скопированные с сайта.
https://www.useragentstring.com/pages/useragentstring.php.
"""

# Чтобы обойти защиту сервера нужно замаскироваться под браузер - мы можем это сделать с помощью отправки загаловков с копировав с сайта
# https://www.useragentstring.com/pages/useragentstring.php

#  Введение в парсинг
# Чтобы обойти защиту сервера нужно замаскироваться под браузер - мы можем это сделать с помощью отправки загаловков с копировав с сайта
# https://www.useragentstring.com/pages/useragentstring.php

# <!-- #### DOM-tree
# #### Основой HTML-документа являются теги.
# #### В соответствии с объектной моделью документа («Document Object Model», коротко DOM), каждый HTML-тег является объектом. Вложенные теги являются «детьми» родительского элемента. Текст, который находится внутри тега, также является объектом.
# #### Все эти объекты доступны при помощи JavaScript, мы можем использовать их для изменения страницы.
#
# #### <title> – заголовок страницы
# #### <h1>…<h6> – заголовки разных уровней
# #### <p> – абзац (paragraph)
# #### <div> – выделения фрагмента документа с целью изменения вида содержимого
# #### <table> – прорисовка таблицы
# #### <tr> – разделитель для строк в таблице
# #### <td> – разделитель для столбцов в таблице
# #### <b> – устанавливает жирное начертание шрифта -->

# <!-- #### Парсер — это скрипт, который грабит информацию с сайта
# #### Краулер — это часть парсера, которая бродит по ссылкам
# #### Краулинг — это переход по страницам и ссылкам
# #### Скрапинг — это сбор данных со страниц
# #### Парсинг — это сразу и краулинг и скрапинг! -->

# <!-- #### CSS-селектор (это когда мы ищем элемент страницы по паре ключ, значение)
# #### язык запросов -XPath (это когда мы прописываем путь по дереву вот так:
# # /html/body/div[1]/div[3]/div/div[2]/div) - Xpath —
# # это язык запросов к элементам xml или xhtml документа. Также как SQL, xpath является декларативным языком запросов. Чтобы получить интересующие данные, необходимо всего лишь создать запрос, описывающий эти данные. Всю «черную» работу за вас выполнит интерпретатор языка xpath. ... Xpath является отраслевым стандартом для доступа к элементам xml и xhtml, xslt преобразований. Вы можете применять его для парсинга любой html-страницы -->
