# <!-- Что такое Палиндром?
# Число палиндрома в Python — это число, которое остается неизменным, когда его цифры меняются местами. Он читается одинаково и вперед, и назад. Чтобы проверить, является ли число палиндромом, мы сравниваем его с обратным числом. Если они равны, число является палиндромом.
#
# Пример: такие числа, как 121, 454 и 888, являются числами-палиндромами, поскольку они читаются одинаково как в прямом, так и в обратном направлении.
#
# Решение проблемы
# 1. Возьмите значение целого числа и сохраните его в переменной.
# 2. Перенесите значение целого числа в другую временную переменную.
# 3. Используя цикл while, получите каждую цифру числа и сохраните перевернутое число в другой переменной.
# 4. Проверьте, совпадает ли обратное число с числом во временной переменной.
# 5. Распечатайте окончательный результат.
# 6. Выход. -->

# +
"""Этот код проверяет, является ли введенное пользователем число палиндромом.

Палиндром — это число, которое читается одинаково как слева направо, так и
справа налево.
"""

n_number = int(input("Введите число: "))
temp = n_number
rev = 0  # переменная для хранения числа в обратном порядке

# Используем цикл while для перебора цифр числа
while n_number > 0:
    dig = n_number % 10  # получаем последнюю цифру числа
    rev = rev * 10 + dig  # добавляем цифру к числу в обратном порядке
    n_number = n_number // 10  # убираем последнюю цифру из оригинального числа

# После завершения цикла сравниваем исходное число с его обратным порядком
if temp == rev:
    print(f"Число {temp} — палиндром!")
else:
    print(f"Число {temp} не является палиндромом!")
# -

1 + 1


# +
def is_palindrome(number: int) -> bool:
    """Check if the given integer is a palindrome.

    The function takes an integer `number`
    as input and returns a boolean value.
    """
    return str(number) == "".join(reversed(str(number)))


# str(n) == ".join(reversed(str(n))): Это сравнение проверяет, равно ли
# исходное строковое представление n перевернутой строке, полученной
# из reversed(str(n)).

# str(n): Преобразует число n в строку для облегчения дальнейших операций.
# reversed(str(n)): Эта функция используется для изменения символов в
# строке, полученной из str(n).
# Он возвращает итератор, который выдает символы в обратном порядке.
# Метод join в Python отвечает за объединение списка строк с помощью
# определенного указателя.


# Получите число от пользователя
input_number = int(input("Введите число:"))

# Проверьте, является ли число палиндромом
if is_palindrome(input_number):
    print("Число палиндром!")
else:
    print("Число не является палиндромом.")
